/****************************必要的变量定义********************************/
#include<reg51.h>
#include<intrins.h> //声明头文件，该头文件包含“_crol_”函数
#define uchar unsigned char
/******************************延时子程序**********************************/
void delay( )
{
   uchar i,j;
   for(i=200;i>0;i--)
   for(j=150;j>0;j--);
}
/*********************************主程序***********************************/
void main( )
{
  uchar i;
  uchar temp=0x00;
    P2=temp;
    while(1)
	{  
	   P2=0x01;        //点亮与P2.0连接的LED灯
	   for(i=0;i<8;i++)
	   {
	   P2=_crol_(P2,1);  //_crol_（）为循环移位函数，对P2存放的数值进行循环移位
	   delay( );         //延时一段时间
	   }
	}
}
